{
    "D":{
    "id": "D",
    "type": "Dominance",
    "nickname": "High D",
    "abbreviation": "D",
    "intro": "Focused, inspirational, strong-willed, self-reliant, and independent.",
    "summary": "D personalities are assertive, results-focused individuals who make rapid decisions and actively seek challenges. They demonstrate a strong desire to lead and possess a keen ability to focus on the big 'picture' while excelling at identifying the next steps in a process.",
    "strengths": "They appreciate logical thinking, concise data, clear goals, and appreciate acknowledgment of their accomplishments.",
    "weaknesses": "They can struggle with teamwork, details, and planning, as well as being too direct, intense, and dictatorial under stress.",
    "communication": "When it comes to communication it is most effective to use logical thinking, concise data, and clear goals",
    "motivation":  "Tend to be motivated by challenges, impact, and a track record of success.",
    "career":  "CEO, entrepreneur, attorney, police officer, and stock broker."
    },
    "I":{
        "id": "I",
        "type": "Influencer",
        "nickname":  "Sun Shine",
        "abbreviation": "I",
        "intro": "Influencers are known for their energetic and sociable nature, bringing a vibrant presence into any environment.",
        "summary":  "I personalities are outgoing, persuasive, and people-oriented. They have an optimistic outlook on difficult situations, strong communication skills, and enjoy variety in their day.",
        "strengths": "I types strengths include their social friendliness, resilience, optimism, and trust. They have a keene ability to connect with others and maintain positive relationships, which contributes to their success in various settings.",
        "weaknesses": "I types typically struggling with consistency, speaking without thinking, being non-traditional, fear of rejection, and controlling emotions.",
        "communication": "When it comes to communication, I-types tend to better understand and engage when someone maintains an upbeat tone and emphasizes the bigger picture instead of getting caught up in details. They value compassion and enthusiasm, and they particularly appreciate it when their accomplishments are acknowledged and highlighted.",
        "motivation": "Motivated by recognition and approval, I types enjoy people-oriented and faster-paced work environments, that require teamwork and collaboration.",
        "career":  "creative director, graphic designer, public relations manager, realtor, and travel agent."
    },
    "S":{
        "id": "S",
        "type": "Steadiness",
        "nickname": "Peace and consistency",
        "abbreviation": "S",
        "intro": "S individuals are known to be people-oriented, highly supportive, and very patient.",
        "summary": "They bridge the management and coworker relationship due to their sincere and dependable nature. Typically S types thrive in stable environments and value peace and consistency.",
        "strengths": "Strengths include understanding different perspectives, thorough evaluation of ideas, advanced listening skills, and effective mediation abilities. They are supporters, calming, loyal, peaceful, and team-oriented.",
        "weaknesses": "Weaknesses include struggling with handling angry or unruly individuals, providing negative feedback, and being productive in emotionally charged environments. They may find it challenging to embrace change and lack assertiveness under pressure.",
        "communication": "When communicating with an S type it is important to be thoughtful, deliberate, and risk-avoidant. They appreciate stability, logical reasoning, documented facts, personal involvement, and respond well to compliments on their patience and perseverance.",
        "motivation": "This personality is motivated by people-oriented roles, slower-paced work environments, routine, stability, and being part of a harmonious team as they measuring their worth through compatibility and contributions.",
        "career":  "dental hygienist, counselor, human resources director, nurse, and therapist."
    }, 
    "C":{
        "id": "C",
        "type": "Conscientiousness",
        "nickname": "FIND ONE",
        "abbreviation": "C",
        "intro": "Individuals with a high C personality strive for accuracy and perfection.",
        "summary": "C types  are data-driven, highly organized, detail-oriented perfectionists. They think logically and are not easily influenced by emotions, which can be advantageous when working on a team. They are focused, insightful, and prefer projects that interest them.",
        "strengths": "Strengths of C types include being task-oriented, analytical, organized, focused, and being diplomatic.",
        "weaknesses": "Weaknesses include being slower-paced, over-analyzation, being wrong, processing criticism, and becoming withdrawn or headstrong when stressed.",
        "communication": "In communication, it is beneficial to approach C-types indirectly and in a non-threatening manner. They value logical reasoning and appreciate being given the opportunity to check and process information before making decisions. Allowing them time and space to analyze information will best serve their needs and facilitate effective communication.",
        "motivation": "C personalities are motivated by understanding the 'why' and 'how' behind things. They work well with a task-oriented approach and prefer slower-paced work environments. Typically this personality values order and logic as they measure their worth through the precision and quality of results.",
        "career":  "software engineer, investment analyst, economist, and scientist."
    },
    "DI/ID":{
        "id": "DI/ID",
        "type": "Influence and Dominance",
        "nickname": "find one ",
        "abbreviation": "DI/ID",
        "intro": "ID/DI types possess excellent persuasive skills and thrive in fast-paced, people-oriented environments.",
        "summary":  "ID/DI personalities are action-oriented and enthusiastic professionals who bring creativity and innovation to the work environment. They have a strong drive for success and are always seeking new ideas. They excel in teams, demonstrating focus, urgency, and direction.",
        "strengths": "These individuals are highly persuasive, thrive in fast-paced settings, and possess strong people skills." ,
        "weaknesses": "DI/ID personalities should exercise caution when it comes to rapidly switching between numerous new ideas or opportunities. Their fast-paced approach may inadvertently cause stress for others. Additionally, they may encounter difficulties in adhering to consistent and predictable routines.",
        "communication":  "ID/DI personalities are known for their direct and open communication style. They are adept at communicating ideas and influencing others.",
        "motivation": "This personality is typically motivated by change, excitement, and spontaneity. They prefer dynamic and challenging roles over slow-paced or repetitive ones.",
        "Jobs" : "Art director, Investment banker, Journalist, Marketing director, Sales representative."
    },
    "DC/CD":{
        "id": "DC/CD",
        "type": "Conscientiousness and Dominance",
        "nickname": "FIND ONE",
        "abbreviation": "DC/CD",
        "intro": "These individuals are characterized by their analytical nature and assertive approach in the workplace.",
        "summary": "This personality prioritizes challenges, results, and accuracy. They excel in being detail-oriented and overachievers.",
        "strengths": "The strengths of DC/Cd types lie in their exceptional attention to detail, assertiveness, and relentless drive for success.",
        "weaknesses": "DC/CD individuals may benefit from slowing down and taking the time to listen to and understand others on their team.",
        "communication": "When communicating with this personality type it’s best to be clear and concise, provide logical reasoning, and offer challenging opportunities for growth.",
        "motivation": "This personality is motivated by the desire to achieve success, intellectual stimulation, and personal growth.",
        "Jobs" : "Architect, Guinness strategist, Chief Financial Officer (CFO), System Administrator, Architect, Lawyer, Physician, Project Manager."
    },
    "IS/SI":{
        "id": "IS/SI",
        "type": "Steadiness and Influence",
        "nickname": "findone",
        "abbreviation": "IS/SI",
        "intro": "Intent listeners and empathetic, they excel at understanding others' perspectives and showing support.",
        "summary": " SI/IS types place a high value on peace and harmony. They strive to create successful situations and promote the growth of others. They find joy in interacting with those around them and use kindness to build strong connections.",
        "strengths": "SI/IS personalities are team-oriented and supportive and have a talent for bringing teams together to work effectively and efficiently.",
        "weaknesses": "This personality has a hard time saying 'no' when necessary and addressing conflicts.",
        "communication": "This personality type responds positively to empathy and understanding. They place great importance on relationships, so adopting a communal approach is highly effective in engaging with them.", 
        "motivation": "They are driven by the desire for acceptance, close relationships, and enhancing the well-being of others.",
        "Jobs" : "Academic advisor, Human resource manager, Teacher, Therapist, Career coach, Public relations manager, Community organizer"
    },
    "SC/CS":{
        "id": "SC/CS",
        "type": "Steadiness and Conscientiousness",
        "nickname": "findone",
        "abbreviation": "SC/CS",
        "intro": "Logical and pragmatic people who strive to complete tasks correctly the first time.",
        "summary": "This personality is known for being meticulous, organized, and thrive in professions that require a detail-oriented approach.",
        "strengths": "SC/CS individuals are supportive and analytical in their work, excelling in professions that involve creating plans, rules, and guidelines.",
        "weaknesses": " This personality can occasionally be hindered by their shyness and discomfort when asking questions.",
        "communication": "When communicating with SC/CS, its important to give clear and comprehensive instructions on a one on one basis as they may feel less comfortable in large group settings.",
        "motivation": "These individuals are motivated by a sense of responsibility and thrive in routine environments.",
        "jobs": "Air traffic controller, Data analyst, IT director, Research scientist, Medical technician, Accountant, Pharmacist"
    }
}